{"gcoe_publications_intro" : "The members of the GPU Center of Excellence share their research results with the community by publications and workshops. Most of the latest GPU-related research publications are listed here.",
 "2017" : [
{
    "author" : "T. Frust, M. Wagner, J. Stephan, G. Juckeland, A. Bieberle",
    "text" : "Rapid data processing for ultrafast X-ray computed tomography using scalable and modular CUDA based pipelines, Computer Physics Communications (2017),",
    "link" : "http://dx.doi.org/10.1016/j.cpc.2017.05.025"
},
{
    "author" : "A. Huebl, R. Widera, F. Schmitt, A. Matthes, N. Podhorszki, J. Y. Choi, S. Klasky, M. Bussmann",
    "text" : "On the Scalability of Data Reduction Techniques in Current and Upcoming HPC Systems from an Application Perspective",
    "link" : ""
},{
    "author" : "A. Matthes, R. Widera, E. Zenker, B. Worpitz, A. Huebl, M. Bussmann",
    "text" : "Tuning and optimization for a variety of many-core architectures without changing a single line of implementation code using the Alpaka library",
    "link" : ""
},{
    "author" : "F. Schmitt and R. Dietrich and G. Juckeland",
    "text" : "Scalable critical-path analysis and optimization guidance for hybrid MPI-CUDA applications, International Journal of High Performance Computing Applications",
    "link" : "http://dx.doi.org/10.1177/1094342016661865"
},{
    "author" : "T. Karnagel, T. Ben-Nun, M. Werner, D. Habich and W. Lehner",
    "text" : "Big Data causing Big (TLB) Problems: Taming Random Memory Accesses on the GPU (2017), Proceedings of the 13th International Workshop on Data Management on New Hardware",
    "link" : "http://doi.acm.org/10.1145/3076113.3076115"
},{
    "author" : "P. Steinbach and M. Werner",
    "text" : "gearshifft - The FFT Benchmark Suite for Heterogeneous Platforms, ISC High Performance 2017",
    "link" : "https://arxiv.org/abs/1702.00629"
}],
 "2016" : [
{
    "author" : "A. Bieberle, T. Frust, M. Wagner, M. Bieberle, U. Hampel",
    "text" : "Data processing performance analysis for ultrafast electron beam X-ray CT using parallel processing hardware architectures, in press",
    "link" : "http://dx.doi.org/10.1016/j.flowmeasinst.2016.04.004"
},{
    "author" : "T. Frust, G. Juckeland, A. Bieberle",
    "text" : "Scalable and Modular Online Data Processing for Ultrafast Computed Tomography Using CUDA Pipelines, Proceedings of the 2nd Workshop on In Situ Infrastructures for Enabling Extreme-scale Analysis and Visualization, Salt Lake City, UT, USA, 2016, pp. 7-11",
    "link" : "https://doi.org/10.1109/ISAV.2016.007"
},{
    "author" : "T. Frust",
    "text" : "Entwicklung und Umsetzung eines echtzeitfähigen Datenverarbeitungs- und Rekonstruktionsalgorithmus für die ultraschnelle Elektronenstrahl-Röntgen-CT, Verteidigung der Diplomarbeit, Dresden, Deutschland"
},{
    "author" : "T. Frust and J. Kelling and G. Juckeland",
    "text" : "In-Situ Analysis and Experiment Regulation at HZDR, PADC Annual Workshop 2016, 17.-18.10.2016, Jülich, Deutschland"
},{
    "author" : "C. Jentzsch, R. Dockhorn, J.-U. Sommer",
    "text" : "A Highly Parallelizable Bond Fluctuation Model on the Body-Centered Cubic Lattice“, Parallel Processing and Applied Mathematics: 11th International Conference, PPAM 2015, Krakow, Poland, September 6-9, 2015. Revised Selected Papers, Part II, pp 301–311",
    "link" : ""
},{
    "author" : "T. Karnagel",
    "text" : "Heterogeneous-Query Optimization; VLDB 2016, PhD Workshop, New Deli, India.",
    "link" : ""
},{
    "author" : "T. Karnagel, D. Habich, W. Lehner",
    "text" : "Limitations of Intra-Operator Parallelism using Heterogeneous Computing Resources; ADBIS 2016, August 27-29., Praha, Czech Republic.",
    "link" : ""
},{
    "author" : "Jeffrey Kelling, Géza Ódor, and Sibylle Gemming",
    "text" : "Universality of (2+1)-dimensional restricted solid-on-solid models. Phys. Rev. E 94, 022107",
    "link" : "http://dx.doi.org/10.1103/PhysRevE.94.022107"
},{
    "author" : "R. Widera and A. Hübl and G. Juckeland",
    "text" : "PIConGPU: First Experiences on Minski, PADC Annual Workshop 2016, 17.-18.10.2016, Jülich, Deutschland"
},{
    "author" : "G. Juckeland and R. Henschel",
    "text" : "In-Depth Performance Analysis for OpenACC/CUDA/OpenCL Applications with Score-P and Vampir, GTC Europe 2016, 28.-29.09.2016, Amsterdam, Nederland"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Local Scale-Invariance of the 2+1 dimensional Kardar-Parisi-Zhang model",
    "link" : "http://arxiv.org/abs/1609.05795"
},{
    "author" : "J. Kelling and G. Ódor and K. H. Heinig and M. Weigel and S. Gemming",
    "text" : "Pushing the Limits of Lattice Monte-Carlo Simulations using GPUs, Perspectives of GPU computing in Science, 26.-28.09.2016, Roma, Italia"
},{
    "author" : "J. Kelling and K.-H. Heinig and S. Gemming",
    "text" : "Experimental-Scale Kinetic Lattice Monte-Carlo Studies on GPU, E-MRS Fall Meeting, 19.-22.09.2016, Warschau, Polen"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Aging In The (2+1)-Dimensional Kardar-Parisi-Zhang Model Under Various Dimer Lattice-Gas Dynamics, Stat'Phys 26 - Statistical Physics Conference Satellite Non-equilibrium dynamics in classical and quantum systems: From quenches to slow relaxations, 13.-22.07.2016, Pont-à-Mousson, France"
},{
    "author" : "G. Juckeland and R. Dietrich",
    "text" : "Profiling Performance of hybrid applications with Score-P and Vampir, Farber, Rob: OpenACC - Parallel Programming with OpenACC, Amsterdam: Elsevier, 2016, 978-0-12-410397-9, 55-68"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Bit-Vectorized GPU Implementation of a Stochastic Cellular Automaton Model for Surface Growth",
    "link" : "https://arxiv.org/abs/1606.00310"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Bit-Vectorized GPU Implementation of a Stochastic Cellular Automaton Model for Surface Growth, 20th Jubilee IEEE International Conference on Intelligent Engineering Systems 2016: IEEE, 30.06.-02.07.2016, Budapest, Ungarn",
    "link" : "http://dx.doi.org/10.1109/INES.2016.7555127"
},{
    "author" : "G. Juckeland and O. Hernandez and A. C. Jacob and D. Neilson and V. G. Vergara Larrea and S. Wienke and S. Chandrasekaran and A. Grund and R. Henschel and M. S. Müller and M. Perminov and P. Shelepugin and B. Whitney and W. Joubert and B. Wang and K. Kumaran and Email: info@spec.org – Website: http://www.spec.org/hpg SPEC High Performance Group (HPG) and A. Bobyr",
    "text" : "From Describing to Prescribing Parallelism: Translating the SPEC ACCEL OpenACC Suite to OpenMP Target Directives, Workshop on Performance Portable Programming Models for Accelerators (P^3MA), 23.06.2016, Frankfurt (Main), Deutschland, Lecture Notes on Computer Science (LNCS) - Volume 9934: High Performance Computing ISC High Performance 2016 International Workshops, ExaComm, E-MuCoCoS, HPC-IODC, IXPUG, IWOPH, P^3MA, VHPC, WOPSSS, Frankfurt, Germany, June 19–23, 2016: Springer, 978-3-319-46078-9, 470-488",
    "link" : "http://dx.doi.org/10.1007/978-3-319-46079-6_33"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Universality of (2+1)-dimensional restricted solid-on-solid models",
    "link" : "http://arxiv.org/abs/1605.02620"
},{
    "author" : "E. Zenker and R. Widera and G. Juckeland and B. Worpitz and A. Hübl and A. Knüpfer and W. E. Nagel and M. Bussmann",
    "text" : "Porting the Plasma Simulation PIConGPU to Heterogeneous Architectures with Alpaka, GPU Technology Conference, 04.-07.04.2016, San Jose, California, USA"
},{
    "author" : "E. Zenker and R. Widera and A. Hübl and G. Juckeland and A. Knüpfer and W. E. Nagel and M. Bussmann",
    "text" : "Performance-Portable Many-Core Plasma Simulations: Porting PIConGPU to OpenPower and Beyond, International Workshop on OpenPower co-located with ISC High Performance, 23.06.2016, Frankfurt, Germany, Lecture Notes in Computer Science, Vol. 9945, 293-301",
    "link" : "http://dx.doi.org/10.1007/978-3-319-46079-6_21"
},{
    "author" : "E. Zenker and B. Worpitz and R. Widera and A. Hübl and G. Juckeland and A. Knüpfer and W. E. Nagel and M. Bussmann",
    "text" : "Alpaka - An Abstraction Library for Parallel Kernel Acceleration, The Sixth International Workshop on Accelerators and Hybrid Exascale Systems co-located with the 30th IEEE International Parallel & Distributed Processing Symposium, 23.-27.05.2016, Chicago Hyatt Regency Chicago, Illinois, USA, Proceedings of the 30th IEEE International Parallel and Distributed Processing Symposium",
    "link" : "https://doi.org/10.1109/IPDPSW.2016.50"
},{
    "author" : "J. Kelling and G. Ódor and S. Gemming",
    "text" : "Non-Local Lattice Encoding for Bit-Vectorized Cellular Automata GPU Implementations",
    "link" : "http://on-demand.gputechconf.com/gtc/2016/posters/GTC_2016_Algorithms_AL_18_P6124_WEB.pdf"
},{
    "author" : "M. Bussmann and C. Eckert and A. Huebl and F. Jung and R. Widera and B. Worpitz and M. Zacharias and E. Zenker and G. Juckeland and A. Knüpfer and W. Nagel",
    "text" : "Alpaka, GrayBat and other spiritual animals that will help you survive in the dangerous world of HPC, ZIH-Kolloquium, 28.01.2016, Dresden, Deutschland"
},{
    "author" : "Jeffrey Kelling, Géza Ódor, and Sibylle Gemming",
    "text" : "Bit-Vectorized GPU Implementation of a Stochastic Cellular Automaton Model for Surface Growth; IEEE 20th International Conference on Intelligent Engineering Systems, Budapest, Hunguary",
    "link" : "https://doi.org/10.1109/INES.2016.7555127"
},{
    "author" : "Lang, M. ; John, A. ; Sommer, J.-U.",
    "text" : "Model simulations on network formation and swelling as obtained from cross-linking co-polymerization reactions, Polymer 82 (2016) 138-155",
    "link" : "http://www.ipfdd.de/en/publications/publication-list/?no_cache=1&tx_publicationsextbase_publication[publication]=46028&tx_publicationsextbase_publication[action]=show&tx_publicationsextbase_publication[controller]=Publication&cHash=85b84873c51f72c564eae51aa7836780"
},{
    "author" : "M. Werner, T. Kolditz, T. Karnagel, D. Habich, W. Lehner",
    "text" : "Multi-GPU Approximation Methods for Silent Data Corruption of AN Codes. Proceedings of the 12th International Workshops on Boolean Problems, September 2016, Freiberg University of Mining and Technology, Freiberg",
    "link" : ""
},{
    "author" : "A. Matthes",
    "text" : "Alpaka - One Programming Model for Parallel Kernel Acceleration of Heterogeneous systems, September 28th, GTC Europe 2016, Amsterdam",
    "link" : ""
},{
    "author" : "A. Matthes, A. Huebl, R. Widera, S. Grottel, S. Gumhold, M. Bussmann",
    "text" : "In situ, steerable, hardware-independent and data-structure agnostic visualization with ISAAC, Supercomputing frontiers and innovations, [S.l.], v. 3, n. 4, p. 30-48, oct. 2016. ISSN 2313-8734.",
    "link" : "http://dx.doi.org/10.14529/jsfi160403"
}],
 "2015" : [
     {
         "author" : "A. Bieberle, M. Vogt, M. Wagner, M. Bieberle, F. Barthel, U. Hampel",
         "text" : "Ultra-fast data processing and image reconstruction using parallel processing architectures, International Symposium on Industrial Process Tomography, Dresden, Germany, 1.-3. September 2015.",
         "link" : ""}
     ,{
         "author" : "Robert Dietrich, Guido Juckeland, Michael Wolfe",
         "text" : "OpenACC Programs Examined: A Performance Analysis Approach, 44th International Conference on Parallel Processing (ICPP), September 2015",
         "link" : "http://dx.doi.org/10.1109/ICPP.2015.40"}
     ,{
         "author" : "Robert Dietrich, Ronny Tschüter",
         "text" : "A Generic Infrastructure for OpenCL Performance Analysis, 8th International Conference on Intelligent Data Acquisition and Advanced Computing Systems (IDAACS), September 2015",
         "link" : "http://dx.doi.org/10.1109/IDAACS.2015.7340754"}
     ,{
         "author" : "Gehrcke, Jan-Philip and Pisabarro, M. Teresa",
         "text" : "Identification and characterization of a glycosaminoglycan binding site on interleukin-10 via molecular simulation methods, Journal of Molecular Graphics and Modelling 62, 97–104, September 2015.",
         "link" : "http://www.sciencedirect.com/science/article/pii/S1093326315300462"}
     ,{
         "author" : "Giesecke, A., Albrecht, T., Gundrum, T., Herault, J., and Stefani, F.",
         "text" : "Triadic resonances in non-linear simulations of a fluid flow in a precessing cylinder, New J. Phys., 17(11):113044",
         "link" : ""}
     ,{
         "author" : "Giesecke, A., Albrecht, T., Gerbeth, G., Gundrum, T., and Stefani, F.",
         "text" : "Numerical simulations for the DRESDYN precession dynamo, Magnetohydrodynamics, 51(2) 293–302",
         "link" : ""}
     ,{
         "author" : "Grottel, Sebastian",
         "text" : "MegaMol–A Prototyping Framework for Particle-based Visualization. In  Visualization and Computer Graphics, IEEE Transactions on 21 (2015), Nr. 2, S. 201–214.",
         "link" : ""}
     ,{
         "author" : "Guido Juckeland, Alexander Grund, Wolfgang E. Nagel, Performance Portable Applications for Hardware Accelerators",
         "text" : "Lessons Learned from SPEC ACCEL, in  Parallel and Distributed Processing Symposium Workshop (IPDPSW), 2015 IEEE International, pages 689-698, 2015. dx.doi.org/10.1109/ipdpsw.2015.26",
         "link" : "http://dx.doi.org/10.1109/ipdpsw.2015.26"}
     ,{
         "author" : "Guido Juckeland, William Brantley, Sunita Chandrasekaran, Barbara Chapman, Shuai Che, Mathew Colgrove, Huiyu Feng, Alexander Grund, Robert Henschel, Wen-mei W. Hwu, Huian Li, Matthias S. Müller, Wolfgang E. Nagel, Maxim Perminov, Pavel Shelepugin, Kevin Skadron, John Stratton, Alexey Titov, Ke Wang, Matthijs van Waveren, Brian Whitney, Sandra Wienke, Rengan Xu and Kalyan Kumaran",
         "text" : " SPEC ACCEL: A Standard Application Suite for Measuring Hardware Accelerator Performance, in: High Performance Computing Systems. Performance Modeling, Benchmarking, and Simulation, pages 46-67, Springer International Publishing. dx.doi.org/10.1007/978-3-319-17248-4_3",
         "link" : "http://dx.doi.org/10.1007/978-3-319-17248-4_3"}
     ,{
         "author" : "Alexander Kirillov, Dmitrij Schlesinger, Walter Forkel, Anatoly Zelenin, Shuai Zheng, Philip Torr, Carsten Rother",
         "text" : "Efficient Likelihood Learning of a Generic CNN-CRF Model for Semantic Segmentation.",
         "link" : "http://arxiv.org/abs/1511.05067"}
     ,{
         "author" : "A. Krull, E. Brachmann, F. Michel, M. Ying Yang, S. Gumhold, C. Rother",
         "text" : "Learning Analysis-by-Synthesis for 6D Pose Estimation in RGB-D Images, Supplementary Material, ICCV.",
         "link" : "http://cvlab-dresden.de/HTML/people/alexander_krull/publications/krull2015-supp.pdf"}
     ,{
         "author" : "David L. Richmond, Dagmar Kainmueller, Michael Y. Yang, Eugene W. Myers, Carsten Rother",
         "text" : "Relating Cascaded Random Forests to Deep Convolutional Neural Networks for Semantic Segmentation.",
         "link" : "http://arxiv.org/abs/1507.07583"}
     ,{
         "author" : "Lang, M. ; Fischer, J. ; Werner, M. ; Sommer, J.-U. Olympic gels",
         "text" : "Concatenation and swelling, Macromolecular Symposia 358 (2015) 140-147",
         "link" : ""}
     ,{
         "author" : "Staib, Joachim; Grottel, Sebastian; Gumhold, Stefan",
         "text" : "Visualization of Particle-based Data with Transparency and Ambient Occlusion. In: Computer Graphics Forum 34 (2015), Nr. 3, S. 151–160, DOI: 10.1111/cgf.12627",
         "link" : ""}
     ,{
         "author" : "Karnagel, T.; Habich, D.; Lehner, W.;",
         "text" : "Local vs. Global Optimization: Operator Placement Strategies in Heterogeneous Environments, First International Workshop on Data (Co)Processing on Heterogeneous Hardware (DAPHNE 2015), March 27, 2015, Brussels, Belgium",
         "link" : ""}
     ,{
         "author" : "Karnagel, T.; Mueller, R.; Lohman, G.;",
         "text" : "Optimizing GPU-accelerated Group-By and Aggregation. In Proceedings of the VLDB Endowment 2015 (ADMS’15), 2015, Kohala Coast, Hawaii, USA.",
         "link" : ""}
     ,{
         "author" : "Nore, C., Léorat, J., Guermond, J.-L., and Giesecke, A.",
         "text" : "Mean-field model of the von Kármán sodium dynamo experiment using soft iron impellers, Phys. Rev. E, 91(1):013008.",
         "link" : ""}
     ,{
         "author" : "F. Stefani, T. Albrecht, G. Gerbeth, A. Giesecke, T. Gundrum, J. Herault, C. Nore, C. Steglich",
         "text" : "Towards a precession driven dynamo experiment”. Magnetohydrodynamics (2015), 51 (2), 275-284.",
         "link" : ""}
     ,{
         "author" : "Werner, M. ; Sommer, J.-U.",
         "text" : "Translocation and induced permeability of random amphiphilic copolymers interacting with lipid bilayer membranes, Biomacromolecules 16 (2015) 125-135",
         "link" : ""}
 ],
 "2014" : [
     {
         "author" : "Felix Schmitt, Jonas Stolle and Robert Dietrich",
         "text" : "CASITA: A Tool for Identifying Critical Optimization Targets in Distributed Heterogeneous Applications, 43th International Conference on Parallel Processing Workshops (ICPPW), September 2014 ",
         "link" : "http://dx.doi.org/10.1109/ICPPW.2014.35"}
     ,{
         "author" : "Felix Schmitt, Robert Dietrich, Guido Juckeland",
         "text" : "Scalable Critical Path Analysis for Hybrid MPI-CUDA Applications, IEEE International Parallel & Distributed Processing Symposium Workshops (IPDPSW), May 2014",
         "link" : "http://dx.doi.org/10.1109/IPDPSW.2014.103"}
     ,{
         "author" : "Galuschko, A. ; Lang, M. ; Kreer, T. ; Sommer, J.-U",
         "text" : "Monte Carlo simulation of thin film polymer melts, Soft Materials 12 (2014) S49-S55",
         "link" : "http://www.ipfdd.de/en/publications/publication-list/?no_cache=1&tx_publicationsextbase_publication[publication]=42582&tx_publicationsextbase_publication[action]=show&tx_publicationsextbase_publication[controller]=Publication&cHash=5ae7b9b0435d1d832e0cf900fd1ed4ee"}
     ,{
         "author" : "Giesecke, A., Stefani, F., and Gerbeth, G.",
         "text" : "Magnetic material in mean-field dynamos driven by small scale helical flows, New J. Phys., 16(7) 073034",
         "link" : ""}
     ,{
         "author" : "C. Jentzsch, J.-U. Sommer",
         "text" : "Polymer brushes in explicit poor solvents studied using a new variant of the bond fluctuation model, Journal of Chemical Physics 141 (2014) 104908",
         "link" : ""}
     ,{
         "author" : "Karnagel, T.; Habich, D.; Schlegel, B.; Lehner, W.",
         "text" : "Heterogeneity-Aware Operator Placement in Column-Store DBMS. Journal  Datenbank-Spektrum, September 2014.",
         "link" : ""}
     ,{
         "author" : "Karnagel, T.; Hille, M.; Ludwig, M.; Habich, D.; Lehner, W.; Heimel, M.; Markl, V.",
         "text" : "Demonstrating Efficient Query Processing in Heterogeneous Environments, Proceedings of the 2014 ACM SIGMOD (Demo Track), June 22-27, 2014, Snowbird, Utah, USA",
         "link" : ""}
     ,{
         "author" : "Lang, M. ; Fischer, J. ; Werner, M. ; Sommer, J.-U.",
         "text" : "Swelling of Olympic gels, Physical Review Letters 112 (2014) 238001(5)",
         "link" : "http://www.ipfdd.de/en/publications/publication-list/?no_cache=1&tx_publicationsextbase_publication[publication]=43488&tx_publicationsextbase_publication[action]=show&tx_publicationsextbase_publication[controller]=Publication&cHash=22117af3a752e35cca4e497b30ba634d"}
     ,{
         "author" : "Ódor, G., Kelling, J., Gemming, S.",
         "text" : "Aging of the (2+1)-dimensional Kardar-Parisi-Zhang model, Phys. Rev. E 89, 032146",
         "link" : ""}
     ,{
         "author" : "Romeis, D. ; Lang, M.",
         "text" : "Excluded volume effects in polymer brushes at moderate chain stretching,  Journal of Chemical Physics 141 (2014) 104901 (1 of 8)",
         "link" : "http://www.ipfdd.de/en/publications/publication-list/?no_cache=1&tx_publicationsextbase_publication[publication]=44462&tx_publicationsextbase_publication[action]=show&tx_publicationsextbase_publication[controller]=Publication&cHash=0a7c50aa27076bbd696c235b6ff311de"}
 ]}
